# Анализ волнового алгоритма

## Временная сложность и практические измерения

| Часть алгоритма | Временная сложность | Время выполнения (сек) | Описание |
|-----------------|---------------------|----------------------|-----------|
| Подсчет вершин | O(E) | {count_time:.6f} | Проход по всем ребрам графа для подсчета уникальных вершин |
| Получение списка вершин | O(E) | {list_time:.6f} | Формирование списка уникальных вершин из ребер |
| Обход вершин | O(V * E) | {traverse_time:.6f} | Поиск кратчайшего пути волновым алгоритмом |
| Восстановление пути | O(V) | {path_time:.6f} | Восстановление найденного пути от конечной до начальной вершины |

где V - количество вершин, E - количество ребер

## Входные данные
```python
edges = [(1, 2), (2, 3), (2, 4), (4, 5), (1, 6), (6, 7), (4, 5)]
start = 1
end = 5
```

## Тестовый стенд
```python
import time

def measure_execution_time(func, *args):
    start_time = time.perf_counter()
    result = func(*args)
    end_time = time.perf_counter()
    return result, end_time - start_time

# Пример использования:
vertices_count, count_time = measure_execution_time(count_vertices, edges)
print(f"Время подсчета вершин: {count_time:.6f} сек")
```
